# Первый класс

**Ограничение времени:** 1 секунда
**Ограничение памяти:** 64.0 Мб
**Ввод:** input.cpp
**Вывод:** стандартный вывод или output.txt

Первый раз в первый класс! Теперь, когда вы изучили классы, пришло время заменить ими структуры.

Вам необходимо реализовать простой класс `Point`, функциональность которого аналогична следующей структуре:

```c++
struct Point {
    double x;
    double y;
};
```

Вы должны создать класс `Point` с:

*   Двумя публичными полями вещественного типа - `x` и `y` соответственно.
*   Оба поля должны быть инициализированы значением 1 по умолчанию.

## Формат ввода

На вход программе ничего не поступает.

## Формат вывода

Программа не должна ничего выводить. Вам требуется только реализовать класс `Point` в соответствии с условием.

## Пример 1

**Ввод**
```
#include <iostream>
#include "solution.cpp"  // Ваш класс

using namespace std;

int main() {
    Point a(1, 5);
    Point b(3);
    Point c;
    cout << "Точка A: (" << a.x << "; " << a.y << ")" << endl;
    cout << "Точка B: (" << b.x << "; " << b.y << ")" << endl;
    cout << "Точка C: (" << c.x << "; " << c.y << ")" << endl;
    return EXIT_SUCCESS;
}
```

**Вывод**
```
Точка A: (1; 5)
Точка B: (3; 1)
Точка C: (1; 1)
```

## Пример 2

**Ввод**
```
#include <iostream>
#include "solution.cpp"  // Ваш класс

using namespace std;

int main() {
    Point a(0, 0);
    Point b;
    Point c;
    c.x = 45;
    c.y = 54;
    cout << "Точка A: (" << a.x << "; " << a.y << ")" << endl;
    cout << "Точка B: (" << b.x << "; " << b.y << ")" << endl;
    cout << "Точка C: (" << c.x << "; " << c.y << ")" << endl;
    return EXIT_SUCCESS;
}
```

**Вывод**
```
Точка A: (0; 0)
Точка B: (1; 1)
Точка C: (45; 54)
```

## Примечания

В тестирующую систему необходимо сдать только определение класса `Point`.