# Гипотенуза

**Ограничение времени:** 1 секунда

**Ограничение памяти:** 64Mb

**Ввод:** стандартный ввод или `input.txt`

**Вывод:** стандартный вывод или `output.txt`

В научной литературе существует целых 367 доказательств теоремы Пифагора!

Мы не просим вас найти новое, а всего лишь воспользоваться ей: для прямоугольного треугольника со сторонами `a` и `b` выведите длину гипотенузы!

## Формат ввода

Единственная строка входного файла содержит два целых числа `a` и `b`, 0 ≤ a, b ≤ 1000.

## Формат вывода

Выведите длину гипотенузы прямоугольного треугольника с катетами `a` и `b` с точностью до 6 знаков после запятой.

## Пример 1

**Ввод**
```
3 4
```

**Вывод**
```
5.000000
```

## Пример 2

**Ввод**
```
1 1
```

**Вывод**
```
1.414214
```

## Пример 3

**Ввод**
```
15 1
```

**Вывод**
```
15.033296
```

## Примечания

Квадратный корень можно вычислить с помощью функции `sqrt` из библиотеки `cmath`. Для вывода числа с фиксированной точностью в 6 знаков после запятой сделайте `cout << fixed` перед выводом числа.