# Степень четвёрки

**Ограничение времени:** 1 секунда

**Ограничение памяти:** 64 Мб

**Ввод:** стандартный ввод или `input.cpp`

**Вывод:** стандартный вывод или `output.txt`

По заданному целому числу n определите, является ли оно степенью четвёрки - то есть существует такое целое x, что n = 4<sup>x</sup>. Верните `true`, если это так; и `false` в обратном случае.

Вы должно реализовать рекурсивную функцию (предикат) `is_valid`, которая принимает один параметр - целочисленное значение и возвращает `true` или `false`. Использование рекурсии в функции `is_valid` обязательно.

Требуемый заголовок функции:

```cpp
bool is_valid(int n)
```

**Формат ввода**

Натуральное число, по модулю не превосходящее 10<sup>6</sup>.

**Формат вывода**

`true` или `false`

**Пример 1**

| Ввод                                | Вывод   |
| ----------------------------------- | ------- |
| ```cpp
#include "solution.cpp"
#include <iostream>

int main() {
    std::cout << std::boolalpha << is_valid(16);
    return 0;
}
``` | `true`  |

**Пример 2**

| Ввод                                | Вывод    |
| ----------------------------------- | -------- |
| ```cpp
#include "solution.cpp"
#include <iostream>

int main() {
    std::cout << std::boolalpha << is_valid(5);
    return 0;
}
``` | `false` |

**Пример 3**

| Ввод                                | Вывод   |
| ----------------------------------- | ------- |
| ```cpp
#include "solution.cpp"
#include <iostream>

int main() {
    std::cout << std::boolalpha << is_valid(1);
    return 0;
}
``` | `true`  |

**Примечания**

В тестирующую систему необходимо сдать только определение функции.