# Прямоугольник

**Ограничение времени:** 1 секунда
**Ограничение памяти:** 96.0 Мб
**Ввод:** input.cpp
**Вывод:** стандартный вывод или output.txt

Для эффективной работы с геометрическими фигурами в иностранной компании необходимо реализовать класс `Rectangle`, который позволит оперировать прямоугольниками на плоскости.

Класс `Rectangle` должен предоставлять следующий функционал:

*   Приватные поля `topLeft` и `bottomRight` с типом `Point`, представляющие верхний левый и нижний правый углы прямоугольника соответственно.
*   Конструктор, принимающий параметры `top_left` и `bottom_right` типа `Point` и инициализирующий соответствующие поля класса.
*   Метод `area`, вычисляющий площадь прямоугольника.
*   Метод `perimeter`, вычисляющий периметр прямоугольника.
*   Метод `print`, который выводит строку вида:
    `Rectangle with top left corner at (x1; y1) and bottom right corner at (x2; y2)`

**Формат ввода**

На вход программе ничего не поступает.

**Формат вывода**

Программа не выводит ничего на экран. Необходимо реализовать класс `Rectangle` с указанным функционалом.

**Пример 1**

| Ввод                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      | Вывод                                                                                       |
| :-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | :------------------------------------------------------------------------------------------ |
| ```cpp
#include <iostream>
#include <string>
#include <cmath>
#include "point.cpp"  // Класс точки из предыдущей задачи
#include "solution.cpp"  // Ваш класс

using namespace std;

int main() {
    Point p1(1, 3);
    Point p2(6, 1);

    Rectangle rect(p1, p2);

    rect.print();
    std::cout << "Area: " << rect.area() << std::endl;
    std::cout << "Perimeter: " << rect.perimeter() << std::endl;

    return EXIT_SUCCESS;
}
``` | `Rectangle with top left corner at (1; 3) and bottom right corner at (6; 1)`<br>`Area: 10`<br>`Perimeter: 14` |

**Пример 2**

| Ввод                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      | Вывод                                                                                         |
| :-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------- |
| ```cpp
#include <cassert>
#include <cmath>
#include <iostream>
#include <string>

#include "point.cpp"  // Класс точки из предыдущей задачи
#include "solution.cpp"  // Ваш класс

using namespace std;

int main() {
    Point p1(0, 0);
    Point p2(10, 10);

    Rectangle rect(p1, p2);

    rect.print();
    std::cout << "Area: " << rect.area() << std::endl;
    std::cout << "Perimeter: " << rect.perimeter() << std::endl;

    assert(rect.area() == 100);

    return EXIT_SUCCESS;
}
``` | `Rectangle with top left corner at (0; 0) and bottom right corner at (10; 10)`<br>`Area: 100`<br>`Perimeter: 40` |

**Примечания**

В тестирующую систему необходимо сдать только определение класса `Rectangle`.

Класс `Rectangle` имеет доступ к классу `Point` из предыдущей задачи "Первоклассная координата".